const String jsonData = '''
{
  "categories": [
    {
      "id": 1,
      "name": "Breakfast",
      "menu_ids": [1, 2]
    },
    {
      "id": 2,
      "name": "Desserts",
      "menu_ids": [2]
    },
    {
      "id": 3,
      "name": "Single Dish",
      "menu_ids": [2]
    },
    {
      "id": 4,
      "name": "Curry",
      "menu_ids": [2]
    },
    {
      "id": 5,
      "name": "Good for health",
      "menu_ids": [2]
    },
    {
      "id": 6,
      "name": "Dinner",
      "menu_ids": [3, 4, 5]
    }
  ],
  "menus": [
    {
      "id": 1,
      "name": "ກະເພົາໝູສັບ",
      "ingredients": [
        {"name": "ຊີ້ນໝູ", "quantity": "400 g"},
        {"name": "ໃບກະເພົາ", "quantity": "50 g"},
        {"name": "ກະທຽມ", "quantity": "ຕາມທີ່ມັກ"},
        {"name": "ໝາກເຜັດ", "quantity": "ຕາມທີ່ມັກ"},
        {"name": "ນໍ້າປາ", "quantity": "1 ບ່ວງແກງ"},
        {"name": "ຊອດຫອຍນາງລົມ", "quantity": "3 ບ່ວງແກງ"},
        {"name": "ນໍ້າຕານ", "quantity": "1/2 ບ່ວງແກງ"}
      ],
      "steps": [
        "ສັບໝູໃຫ້ລະອຽດຕາມຄວາມຕ້ອງການແລ້ວພັກໄວ້.",
        "ຕໍາໝາກເຜັດ ແລະ ກະທຽມໃຫ້ລະອຽດ.",
        "ຕັ້ງໝໍ້ໃຫ້ຮ້ອນ ແລ້ວໃສ່ນໍ້າມັນພືດລົງໄປ ຜັດໝາກເຜັດ ແລະ ກະທຽມທີ່ຕໍາໄວ້ໃຫ້ຫອມ.",
        "ເມື່ອໝາກເຜັດ ແລະ ກະທຽມຫອມໄດ້ທີ່ແລ້ວເອົາໝູທີ່ສັບລົງໄປຂົ້ວໃຫ້ສຸກ, ປຸງລົດຕາມໃຈໂດຍໃສ່ນໍ້າປາ, ຊອດຫອຍນາງລົມ ແລະ ນໍ້າຕານ.",
        "ຊິມພໍດີແລ້ວໃສ່ໃບກະເພົາແລ້ວປິດໄຟໄດ້ເລີຍ."
      ]
    },
    {
      "id": 2,
      "name": "ກະຫຼໍາປີພັດນໍ້າປາ",
      "ingredients": [
        {"name": "ກະຫຼໍາປີ", "quantity": "1 ຫົວ"},
        {"name": "ກະທຽມ", "quantity": "ຕາມທີ່ມັກ"},
        {"name": "ໝາກເຜັດ", "quantity": "ຕາມທີ່ມັກ"},
        {"name": "ນໍ້າປາ", "quantity": "2 ບ່ວງແກງ"}
      ],
      "steps": [
        "ລ້າງກະຫຼໍາປີໃຫ້ສະອາດແລ້ວຫັ່ນເປັນຊິ້ນພອດີຄໍາ.",
        "ຕໍາໝາກເຜັດ ແລະ ກະທຽມໃຫ້ລະອຽດ.",
        "ຕັ້ງໝໍ້ໃຫ້ຮ້ອນແລ້ວໃສ່ນໍ້າມັນພືດລົງໄປ, ຜັດໝາກເຜັດ ແລະ ກະທຽມໃຫ້ຫອມ.",
        "ໃສ່ກະຫຼໍາປີລົງໄປຜັດໃຫ້ສຸກປຸງລົດດ້ວຍນໍ້າປາ."
      ]
    },
    {
      "id": 3,
      "name": "Sample Menu 3",
      "ingredients": [
        {"name": "Sample Ingredient 1", "quantity": "100 g"},
        {"name": "Sample Ingredient 2", "quantity": "200 g"}
      ],
      "steps": [
        "Sample Step 1",
        "Sample Step 2"
      ]
    }
  ]
}
''';